# Используем официальный образ Node.js (подберите подходящую версию)
FROM node:18-alpine

# Устанавливаем рабочую директорию внутри контейнера
WORKDIR /app

# Копируем файлы package.json и package-lock.json (если есть) для установки зависимостей
COPY package*.json ./

# Устанавливаем зависимости
RUN npm install

# Копируем остальные файлы проекта
COPY . .

# Собираем проект
RUN npm run build

# Открываем порт, на котором будет работать Next.js
EXPOSE 3000

# Запускаем приложение
CMD ["npm", "start"]
